In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
from matplotlib import pyplot as plt

In [2]:
df=pd.read_csv("E:/my_pro_ds/ml/titanic/titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1.0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0.0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

PassengerId       0
Survived        418
Pclass            0
Name              0
Sex               0
Age             263
SibSp             0
Parch             0
Ticket            0
Fare              1
Cabin          1014
Embarked          2
dtype: int64

In [5]:
df.shape

(1309, 12)

In [9]:
x_test=df.loc[df["Survived"]==None]

In [10]:
df=df.loc[df["Survived"]!=None]

In [11]:
df.shape

(1309, 12)

In [12]:
x_test.shape

(0, 12)

In [13]:
x_test.head()

Empty DataFrame
Columns: [PassengerId, Survived, Pclass, Name, Sex, Age, SibSp, Parch, Ticket, Fare, Cabin, Embarked]
Index: []

In [18]:
x_test=df[df.Survived.isnull()]

In [23]:
df=df[df.Survived.notnull()]

In [24]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [25]:
df.shape

(891, 12)

In [28]:
df.columns=[x.lower() for x in df.columns]

In [29]:
df[df.embarked.isnull()]

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
61,62,1.0,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1.0,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [30]:
df.passengerid.value_counts()

891    1
293    1
304    1
303    1
302    1
      ..
591    1
590    1
589    1
588    1
1      1
Name: passengerid, Length: 891, dtype: int64

In [32]:
df.pclass.value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

In [34]:
import time
for i in df.columns:
    print(df[i].value_counts())
    print(time.sleep(2))

891    1
293    1
304    1
303    1
302    1
      ..
591    1
590    1
589    1
588    1
1      1
Name: passengerid, Length: 891, dtype: int64
None
0.0    549
1.0    342
Name: survived, dtype: int64
None
3    491
1    216
2    184
Name: pclass, dtype: int64
None
Ayoub, Miss. Banoura                1
Kelly, Mrs. Florence "Fannie"       1
Daly, Mr. Eugene Patrick            1
Hassan, Mr. Houssein G N            1
Coleff, Mr. Peju                    1
                                   ..
Sobey, Mr. Samuel James Hayden      1
Christy, Miss. Julie Rachel         1
Skoog, Miss. Margit Elizabeth       1
Silverthorne, Mr. Spencer Victor    1
Samaan, Mr. Youssef                 1
Name: name, Length: 891, dtype: int64
None
male      577
female    314
Name: sex, dtype: int64
None
24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: age, Length: 88, dtype: int64
None
0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: sibsp, dtype: int64
None
0    678
1    118
2     80
5      5
3      5
4      4
6      1
Name: parch, dtype: int64
None
347082           7
CA. 2343         7
1601             7
CA 2144          6
347088           6
                ..
SC/PARIS 2149    1
W.E.P. 5734      1
350406           1
C.A. 6212        1
111426           1
Name: ticket, Length: 681, dtype: int64
None
8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: fare, Length: 248, dtype: int64
None
C23 C25 C27    4
B96 B98        4
G6             4
D              3
F33            3
              ..
D37            1
D10 D12        1
B82 B84        1
B42            1
D15            1
Name: cabin, Length: 147, dtype: int64
None
S    644
C    168
Q     77
Name: embarked, dtype: int64
None

In [36]:
df.describe(include="all")

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Ayoub, Miss. Banoura",male,NaN,NaN,NaN,347082,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN